In [1]:
import pandas as pd
import numpy as np
import pandas_profiling

In [2]:
pd.__version__

'1.0.3'

In [3]:
np.__version__

'1.18.1'

In [4]:
ind = [('AP', 2000), ('AP', 2010),
         ('KA', 2000), ('KA', 2010),
         ('TN', 2000), ('TN', 2010),
      ('TS',2000),('TS',2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561,
              2504789,5689752]

In [5]:
pop = pd.Series(populations, index=ind)
pop

(AP, 2000)    33871648
(AP, 2010)    37253956
(KA, 2000)    18976457
(KA, 2010)    19378102
(TN, 2000)    20851820
(TN, 2010)    25145561
(TS, 2000)     2504789
(TS, 2010)     5689752
dtype: int64

In [6]:
pop[('AP', 2000)]

33871648

In [7]:
pop[0]

33871648

In [8]:
pop[('AP', 2010):('TS', 2000)]

(AP, 2010)    37253956
(KA, 2000)    18976457
(KA, 2010)    19378102
(TN, 2000)    20851820
(TN, 2010)    25145561
(TS, 2000)     2504789
dtype: int64

In [9]:
pop[0:5]

(AP, 2000)    33871648
(AP, 2010)    37253956
(KA, 2000)    18976457
(KA, 2010)    19378102
(TN, 2000)    20851820
dtype: int64

In [10]:
pop.index

Index([('AP', 2000), ('AP', 2010), ('KA', 2000), ('KA', 2010), ('TN', 2000),
       ('TN', 2010), ('TS', 2000), ('TS', 2010)],
      dtype='object')

In [11]:
pop[[i for i in pop.index if i[1] == 2010]]

(AP, 2010)    37253956
(KA, 2010)    19378102
(TN, 2010)    25145561
(TS, 2010)     5689752
dtype: int64

In [12]:
for i in pop.index:  
    if i[1]==2010:
        print(i,pop[i])

('AP', 2010) 37253956
('KA', 2010) 19378102
('TN', 2010) 25145561
('TS', 2010) 5689752

In [13]:
pop.index

Index([('AP', 2000), ('AP', 2010), ('KA', 2000), ('KA', 2010), ('TN', 2000),
       ('TN', 2010), ('TS', 2000), ('TS', 2010)],
      dtype='object')

In [14]:
index = pd.MultiIndex.from_tuples(ind)
index

MultiIndex([('AP', 2000),
            ('AP', 2010),
            ('KA', 2000),
            ('KA', 2010),
            ('TN', 2000),
            ('TN', 2010),
            ('TS', 2000),
            ('TS', 2010)],
           )

In [15]:
pop = pop.reindex(index)
pop

AP  2000    33871648
    2010    37253956
KA  2000    18976457
    2010    19378102
TN  2000    20851820
    2010    25145561
TS  2000     2504789
    2010     5689752
dtype: int64

In [16]:
pop['AP']

2000    33871648
2010    37253956
dtype: int64

In [17]:
pop[0]

33871648

In [18]:
pop[2]

18976457

In [19]:
pop[0:4]

AP  2000    33871648
    2010    37253956
KA  2000    18976457
    2010    19378102
dtype: int64

In [20]:
pop[0::2]

AP  2000    33871648
KA  2000    18976457
TN  2000    20851820
TS  2000     2504789
dtype: int64

In [21]:
pop[::-1]

TS  2010     5689752
    2000     2504789
TN  2010    25145561
    2000    20851820
KA  2010    19378102
    2000    18976457
AP  2010    37253956
    2000    33871648
dtype: int64

In [23]:
pop[:,2010]

AP    37253956
KA    19378102
TN    25145561
TS     5689752
dtype: int64

In [24]:
pop.ndim

1

In [25]:
pop

AP  2000    33871648
    2010    37253956
KA  2000    18976457
    2010    19378102
TN  2000    20851820
    2010    25145561
TS  2000     2504789
    2010     5689752
dtype: int64

In [26]:
pop_df = pop.unstack()
pop_df

        2000      2010
AP  33871648  37253956
KA  18976457  19378102
TN  20851820  25145561
TS   2504789   5689752

In [27]:
pop_df.ndim

2

In [28]:
Se = pop_df.stack()
Se

AP  2000    33871648
    2010    37253956
KA  2000    18976457
    2010    19378102
TN  2000    20851820
    2010    25145561
TS  2000     2504789
    2010     5689752
dtype: int64

In [29]:
Se.ndim

1

In [30]:
pop

AP  2000    33871648
    2010    37253956
KA  2000    18976457
    2010    19378102
TN  2000    20851820
    2010    25145561
TS  2000     2504789
    2010     5689752
dtype: int64

In [31]:
pop_df = pd.DataFrame({'Total': pop,
                       'Under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014,
                                   4789423, 5897821
                                  ]})
pop_df

            Total  Under18
AP 2000  33871648  9267089
   2010  37253956  9284094
KA 2000  18976457  4687374
   2010  19378102  4318033
TN 2000  20851820  5906301
   2010  25145561  6879014
TS 2000   2504789  4789423
   2010   5689752  5897821

In [32]:
pop_df['Total']

AP  2000    33871648
    2010    37253956
KA  2000    18976457
    2010    19378102
TN  2000    20851820
    2010    25145561
TS  2000     2504789
    2010     5689752
Name: Total, dtype: int64

In [33]:
f_u18 = pop_df['Under18'] / pop_df['Total']
f_u18.unstack()

        2000      2010
AP  0.273594  0.249211
KA  0.247010  0.222831
TN  0.283251  0.273568
TS  1.912106  1.036569

In [34]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.572496  0.859348
  2  0.889256  0.910219
b 1  0.089214  0.549091
  2  0.761219  0.459295

In [35]:
data = {('Ap', 2000): 33871648,
        ('Ap', 2010): 37253956,
        ('TS', 2000): 20851820,
        ('TS', 2010): 25145561,
        ('TN', 2000): 18976457,
        ('TN', 2010): 19378102}
pd.Series(data)

Ap  2000    33871648
    2010    37253956
TS  2000    20851820
    2010    25145561
TN  2000    18976457
    2010    19378102
dtype: int64

In [36]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [37]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [38]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [39]:
pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
              codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [40]:
pop.index.names = ['state', 'year']
pop

state  year
AP     2000    33871648
       2010    37253956
KA     2000    18976457
       2010    19378102
TN     2000    20851820
       2010    25145561
TS     2000     2504789
       2010     5689752
dtype: int64

In [41]:
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2, 3]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Ram', 'Shan', 'Sam'], ['BMI', 'Temp','Weight']],
                                     names=['Name_pas', 'type_dis'])

In [42]:
data = np.round(np.random.randn(6, 9), 2)
data

array([[ 0.19,  0.19,  0.5 , -0.04,  1.09, -1.52, -0.93, -1.13,  1.24],
       [ 0.95,  0.41,  1.57, -0.37, -0.26, -1.17, -0.77, -0.16,  0.86],
       [ 0.09,  0.02,  1.58,  1.39, -0.09, -0.72,  0.79, -1.69, -1.99],
       [ 0.19,  0.08, -1.62,  0.4 , -0.15, -0.37, -0.67, -0.61, -1.54],
       [ 1.88,  0.91,  1.12,  0.92,  0.34, -0.78,  0.44, -1.25, -0.33],
       [ 0.08, -2.38, -0.37,  0.74,  0.59, -0.09, -3.04, -0.43, -0.75]])

In [43]:
data[:, ::2] *= 10
data

array([[ 1.90e+00,  1.90e-01,  5.00e+00, -4.00e-02,  1.09e+01, -1.52e+00,
        -9.30e+00, -1.13e+00,  1.24e+01],
       [ 9.50e+00,  4.10e-01,  1.57e+01, -3.70e-01, -2.60e+00, -1.17e+00,
        -7.70e+00, -1.60e-01,  8.60e+00],
       [ 9.00e-01,  2.00e-02,  1.58e+01,  1.39e+00, -9.00e-01, -7.20e-01,
         7.90e+00, -1.69e+00, -1.99e+01],
       [ 1.90e+00,  8.00e-02, -1.62e+01,  4.00e-01, -1.50e+00, -3.70e-01,
        -6.70e+00, -6.10e-01, -1.54e+01],
       [ 1.88e+01,  9.10e-01,  1.12e+01,  9.20e-01,  3.40e+00, -7.80e-01,
         4.40e+00, -1.25e+00, -3.30e+00],
       [ 8.00e-01, -2.38e+00, -3.70e+00,  7.40e-01,  5.90e+00, -9.00e-02,
        -3.04e+01, -4.30e-01, -7.50e+00]])

In [44]:
data += 37
data

array([[38.9 , 37.19, 42.  , 36.96, 47.9 , 35.48, 27.7 , 35.87, 49.4 ],
       [46.5 , 37.41, 52.7 , 36.63, 34.4 , 35.83, 29.3 , 36.84, 45.6 ],
       [37.9 , 37.02, 52.8 , 38.39, 36.1 , 36.28, 44.9 , 35.31, 17.1 ],
       [38.9 , 37.08, 20.8 , 37.4 , 35.5 , 36.63, 30.3 , 36.39, 21.6 ],
       [55.8 , 37.91, 48.2 , 37.92, 40.4 , 36.22, 41.4 , 35.75, 33.7 ],
       [37.8 , 34.62, 33.3 , 37.74, 42.9 , 36.91,  6.6 , 36.57, 29.5 ]])

In [45]:
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

Name_pas     Ram                 Shan                Sam
type_dis     BMI   Temp Weight    BMI  Temp Weight   BMI   Temp Weight
year visit
2013 1      38.9  37.19   42.0  36.96  47.9  35.48  27.7  35.87   49.4
     2      46.5  37.41   52.7  36.63  34.4  35.83  29.3  36.84   45.6
     3      37.9  37.02   52.8  38.39  36.1  36.28  44.9  35.31   17.1
2014 1      38.9  37.08   20.8  37.40  35.5  36.63  30.3  36.39   21.6
     2      55.8  37.91   48.2  37.92  40.4  36.22  41.4  35.75   33.7
     3      37.8  34.62   33.3  37.74  42.9  36.91   6.6  36.57   29.5

In [46]:
health_data.to_csv("Health_Data_For_Multiindexing.csv")

In [47]:
health_data

Name_pas     Ram                 Shan                Sam
type_dis     BMI   Temp Weight    BMI  Temp Weight   BMI   Temp Weight
year visit
2013 1      38.9  37.19   42.0  36.96  47.9  35.48  27.7  35.87   49.4
     2      46.5  37.41   52.7  36.63  34.4  35.83  29.3  36.84   45.6
     3      37.9  37.02   52.8  38.39  36.1  36.28  44.9  35.31   17.1
2014 1      38.9  37.08   20.8  37.40  35.5  36.63  30.3  36.39   21.6
     2      55.8  37.91   48.2  37.92  40.4  36.22  41.4  35.75   33.7
     3      37.8  34.62   33.3  37.74  42.9  36.91   6.6  36.57   29.5

In [48]:
health_data['Ram']

type_dis     BMI   Temp  Weight
year visit
2013 1      38.9  37.19    42.0
     2      46.5  37.41    52.7
     3      37.9  37.02    52.8
2014 1      38.9  37.08    20.8
     2      55.8  37.91    48.2
     3      37.8  34.62    33.3

In [49]:
health_data.iloc[1]

Name_pas  type_dis
Ram       BMI         46.50
          Temp        37.41
          Weight      52.70
Shan      BMI         36.63
          Temp        34.40
          Weight      35.83
Sam       BMI         29.30
          Temp        36.84
          Weight      45.60
Name: (2013, 2), dtype: float64

In [50]:
health_data.iloc[1:2]

Name_pas     Ram                 Shan                Sam
type_dis     BMI   Temp Weight    BMI  Temp Weight   BMI   Temp Weight
year visit
2013 2      46.5  37.41   52.7  36.63  34.4  35.83  29.3  36.84   45.6

In [51]:
pop

state  year
AP     2000    33871648
       2010    37253956
KA     2000    18976457
       2010    19378102
TN     2000    20851820
       2010    25145561
TS     2000     2504789
       2010     5689752
dtype: int64

In [52]:
pop['AP', 2000]

33871648

In [53]:
pop['AP']

year
2000    33871648
2010    37253956
dtype: int64

In [54]:
pop.loc['AP':'TN']

state  year
AP     2000    33871648
       2010    37253956
KA     2000    18976457
       2010    19378102
TN     2000    20851820
       2010    25145561
dtype: int64

In [55]:
pop[:, 2000]

state
AP    33871648
KA    18976457
TN    20851820
TS     2504789
dtype: int64

In [56]:
pop[pop > 22000000]

state  year
AP     2000    33871648
       2010    37253956
TN     2010    25145561
dtype: int64

In [57]:
pop[['AP', 'TN']]

state  year
AP     2000    33871648
       2010    37253956
TN     2000    20851820
       2010    25145561
dtype: int64

In [58]:
health_data

Name_pas     Ram                 Shan                Sam
type_dis     BMI   Temp Weight    BMI  Temp Weight   BMI   Temp Weight
year visit
2013 1      38.9  37.19   42.0  36.96  47.9  35.48  27.7  35.87   49.4
     2      46.5  37.41   52.7  36.63  34.4  35.83  29.3  36.84   45.6
     3      37.9  37.02   52.8  38.39  36.1  36.28  44.9  35.31   17.1
2014 1      38.9  37.08   20.8  37.40  35.5  36.63  30.3  36.39   21.6
     2      55.8  37.91   48.2  37.92  40.4  36.22  41.4  35.75   33.7
     3      37.8  34.62   33.3  37.74  42.9  36.91   6.6  36.57   29.5

In [59]:
health_data['Ram']

type_dis     BMI   Temp  Weight
year visit
2013 1      38.9  37.19    42.0
     2      46.5  37.41    52.7
     3      37.9  37.02    52.8
2014 1      38.9  37.08    20.8
     2      55.8  37.91    48.2
     3      37.8  34.62    33.3

In [60]:
health_data.iloc[:1]

Name_pas     Ram                 Shan                Sam
type_dis     BMI   Temp Weight    BMI  Temp Weight   BMI   Temp Weight
year visit
2013 1      38.9  37.19   42.0  36.96  47.9  35.48  27.7  35.87   49.4

In [61]:
health_data.iloc[3:-1]

Name_pas     Ram                 Shan                Sam
type_dis     BMI   Temp Weight    BMI  Temp Weight   BMI   Temp Weight
year visit
2014 1      38.9  37.08   20.8  37.40  35.5  36.63  30.3  36.39   21.6
     2      55.8  37.91   48.2  37.92  40.4  36.22  41.4  35.75   33.7

In [62]:
health_data.iloc[:3,:-3]

Name_pas     Ram                 Shan
type_dis     BMI   Temp Weight    BMI  Temp Weight
year visit
2013 1      38.9  37.19   42.0  36.96  47.9  35.48
     2      46.5  37.41   52.7  36.63  34.4  35.83
     3      37.9  37.02   52.8  38.39  36.1  36.28

In [63]:
health_data.iloc[-3:,:]

Name_pas     Ram                 Shan                Sam
type_dis     BMI   Temp Weight    BMI  Temp Weight   BMI   Temp Weight
year visit
2014 1      38.9  37.08   20.8  37.40  35.5  36.63  30.3  36.39   21.6
     2      55.8  37.91   48.2  37.92  40.4  36.22  41.4  35.75   33.7
     3      37.8  34.62   33.3  37.74  42.9  36.91   6.6  36.57   29.5

In [64]:
health_data.loc[:, ('Ram', 'Temp')]

year  visit
2013  1        37.19
      2        37.41
      3        37.02
2014  1        37.08
      2        37.91
      3        34.62
Name: (Ram, Temp), dtype: float64

In [65]:
health_data.loc[:,('Ram')]

type_dis     BMI   Temp  Weight
year visit
2013 1      38.9  37.19    42.0
     2      46.5  37.41    52.7
     3      37.9  37.02    52.8
2014 1      38.9  37.08    20.8
     2      55.8  37.91    48.2
     3      37.8  34.62    33.3

In [65]:
health_data.loc[(:, 1), (:, 'HR')]

SyntaxError: invalid syntax (<ipython-input-65-fb34fa30ac09>, line 1)

In [66]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'Temp']]

Name_pas      Ram  Shan    Sam
type_dis     Temp  Temp   Temp
year visit
2013 1      37.19  47.9  35.87
2014 1      37.08  35.5  36.39

In [67]:
health_data.loc[idx[2:,2],idx[:,'BMI']]

Name_pas     Ram   Shan   Sam
type_dis     BMI    BMI   BMI
year visit
2013 2      46.5  36.63  29.3
2014 2      55.8  37.92  41.4

In [68]:
index = pd.MultiIndex.from_product([['a', 'c', 'b','d'], [1, 2]])
data = pd.Series(np.random.rand(8), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.718840
      2      0.813958
c     1      0.696141
      2      0.195442
b     1      0.789262
      2      0.914231
d     1      0.816429
      2      0.961428
dtype: float64

In [69]:
data['a':'c']

UnsortedIndexError: 'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [70]:
try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e)

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [71]:
data = data.sort_index()
data

char  int
a     1      0.718840
      2      0.813958
b     1      0.789262
      2      0.914231
c     1      0.696141
      2      0.195442
d     1      0.816429
      2      0.961428
dtype: float64

In [72]:
data['a':'c']

char  int
a     1      0.718840
      2      0.813958
b     1      0.789262
      2      0.914231
c     1      0.696141
      2      0.195442
dtype: float64

In [73]:
pop

state  year
AP     2000    33871648
       2010    37253956
KA     2000    18976457
       2010    19378102
TN     2000    20851820
       2010    25145561
TS     2000     2504789
       2010     5689752
dtype: int64

In [74]:
pop.unstack()

year       2000      2010
state
AP     33871648  37253956
KA     18976457  19378102
TN     20851820  25145561
TS      2504789   5689752

In [75]:
pop.unstack(level=0)

state        AP        KA        TN       TS
year
2000   33871648  18976457  20851820  2504789
2010   37253956  19378102  25145561  5689752

In [76]:
pop.unstack(level=1)

year       2000      2010
state
AP     33871648  37253956
KA     18976457  19378102
TN     20851820  25145561
TS      2504789   5689752

In [77]:
pop.unstack().stack()

state  year
AP     2000    33871648
       2010    37253956
KA     2000    18976457
       2010    19378102
TN     2000    20851820
       2010    25145561
TS     2000     2504789
       2010     5689752
dtype: int64

In [78]:
pop.unstack().stack(level=0)

state  year
AP     2000    33871648
       2010    37253956
KA     2000    18976457
       2010    19378102
TN     2000    20851820
       2010    25145561
TS     2000     2504789
       2010     5689752
dtype: int64

In [79]:
pop_flat = pop.reset_index(name='population') # set the Col name
pop_flat

  state  year  population
0    AP  2000    33871648
1    AP  2010    37253956
2    KA  2000    18976457
3    KA  2010    19378102
4    TN  2000    20851820
5    TN  2010    25145561
6    TS  2000     2504789
7    TS  2010     5689752

In [80]:
pop_flat.set_index(['state','year'])

            population
state year
AP    2000    33871648
      2010    37253956
KA    2000    18976457
      2010    19378102
TN    2000    20851820
      2010    25145561
TS    2000     2504789
      2010     5689752

In [81]:
health_data

Name_pas     Ram                 Shan                Sam
type_dis     BMI   Temp Weight    BMI  Temp Weight   BMI   Temp Weight
year visit
2013 1      38.9  37.19   42.0  36.96  47.9  35.48  27.7  35.87   49.4
     2      46.5  37.41   52.7  36.63  34.4  35.83  29.3  36.84   45.6
     3      37.9  37.02   52.8  38.39  36.1  36.28  44.9  35.31   17.1
2014 1      38.9  37.08   20.8  37.40  35.5  36.63  30.3  36.39   21.6
     2      55.8  37.91   48.2  37.92  40.4  36.22  41.4  35.75   33.7
     3      37.8  34.62   33.3  37.74  42.9  36.91   6.6  36.57   29.5

In [82]:
data_mean = health_data.mean(level='visit')
data_mean

Name_pas    Ram                   Shan                  Sam
type_dis    BMI    Temp Weight     BMI  Temp  Weight    BMI    Temp Weight
visit
1         38.90  37.135  31.40  37.180  41.7  36.055  29.00  36.130  35.50
2         51.15  37.660  50.45  37.275  37.4  36.025  35.35  36.295  39.65
3         37.85  35.820  43.05  38.065  39.5  36.595  25.75  35.940  23.30

In [83]:
data_mean = health_data.mean(level='year')
data_mean

Name_pas        Ram                             Shan                        \
type_dis        BMI       Temp     Weight        BMI       Temp     Weight
year
2013      41.100000  37.206667  49.166667  37.326667  39.466667  35.863333
2014      44.166667  36.536667  34.100000  37.686667  39.600000  36.586667

Name_pas        Sam
type_dis        BMI       Temp     Weight
year
2013      33.966667  36.006667  37.366667
2014      26.100000  36.236667  28.266667

In [84]:
data_mean.mean(axis=1, level='type_dis')

type_dis        BMI       Temp     Weight
year
2013      37.464444  37.560000  40.798889
2014      35.984444  37.457778  32.984444